Revit 2027 API
ParameterTypeId.SteelElemWeldDoublePrepdepth Property
 "Double Preparation Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldDoublePrepdepth { get; }
Public Shared ReadOnly Property SteelElemWeldDoublePrepdepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldDoublePrepdepth {
	ForgeTypeId^ get ();
}
static member SteelElemWeldDoublePrepdepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace